read -sv example.sv
hierarchy -top example
proc; opt; techmap; opt
synth_ecp5
write_json synth-ecp5.json
